In [4]:
x=10
y=15

z=x if x<y else y
print(x)

10

In [8]:
ORD("A")

NameError: name 'ORD' is not defined

In [13]:
x=[1,2,3,4,5]
i=-1
while ((i:=i+1)<len(x)):
    print(x[i])

1
2
3
4
5

In [24]:
str1="sky is blue"
mylist=str1.split()

mylist=mylist[::-1]

str2=" ".join(mylist)
print(str2)

blue is sky

In [26]:
str1=" ".join("sky is blue".split()[::-1])

str1

'blue is sky'

#find single occurence of elements

In [72]:
lst=[1,2,2,2,3,3,4,4,5,6,6,7,7,8,8,9,9,10,10]
lst2=[]
for num in lst:
    if lst.count(num)==1:
        lst2.append(num)
print(lst2)

[1, 5]

In [31]:
# list comprehension    
# [expression for variable in iterable *** if condition]


lst3=[num for num in lst if lst.count(num)==1]
lst3

[4, 5]

In [37]:
lst4=[2,3,4,5,6,9]
[num*num for num in lst4]

[4, 9, 16, 25, 36, 81]

In [36]:
[num for num in lst4 if num%2==0]

[2, 4]

In [38]:
[num*num for num in lst4 if num%2==0 if num%3==0]

[36]

In [40]:
## if else list comprehension
## [expression if condition else expression for variable in iterable]

[num*num if num%2==0 else num*num*num for num in lst4]

[4, 27, 16, 125, 36, 729]

In [46]:
print([i for i in range(1,3)])
print([j for j in range(4,6)])

[1, 2]
[4, 5]

In [41]:
[i*j for i in range(1,3) for j in range(4,6)]

[4, 5, 8, 10]

In [74]:
mystr="a,a,a,b,b,c,c,c,c,d,d,d,d,d"

mylist=mystr.split(",")
visited=[]

for i in mylist:
    if i not in visited:
        visited.append(i)
        print(i,mylist.count(i))

a 3
b 2
c 4
d 5

In [48]:
## finding minimum and maximum in a list
lst=[15,2,3,74,5,6,97,8,9,10]

min=lst[0]
max=lst[0]
for i in lst:
    if i<min:
        min=i
    if i>max:
        max=i

print(min,max)

2 97

In [50]:
lst6=[15,2,3,74,5,6,97,8,9,10]
lst7=[125,233,453,754,5,6,97,8,9,10]

lst6.extend(lst7)
lst6

[15, 2, 3, 74, 5, 6, 97, 8, 9, 10, 125, 233, 453, 754, 5, 6, 97, 8, 9, 10]

In [76]:
str1="sky is blue blue sky sky sree sree sree"

mylist=str1.split()
for i in mylist:
    print(i,mylist.count(i))

sky 3
is 1
blue 2
blue 2
sky 3
sky 3
sree 3
sree 3
sree 3

In [77]:
x=[i for i in mylist if mylist.count(i)>=2]
print(set(x))

{'sree', 'sky', 'blue'}

In [2]:
### password checker

def password_checker(password):
    if len(password)<8:
        return "password should be atleast 8 characters"
    elif not any(i.isdigit() for i in password):
        return "password should have atleast one digit"
    elif not any(i.isupper() for i in password):
        return "password should have atleast one uppercase letter"
    elif not any(i.islower() for i in password):
        return "password should have atleast one lowercase letter"
    else:
        return "password is good"
    
password_checker("Sree1234")

'password is good'

In [3]:
## total price in the cart
cart=[{"item":"apple","price":10,"quantity":2},
      {"item":"banana","price":5,"quantity":3},
      {"item":"orange","price":15,"quantity":1}]


total=0

for i in cart:
    total+=i["price"]*i["quantity"]
print(total)

50

In [31]:
# collection[start:stop:step] is [::]

s="srikanta"


s[0::2]

'siat'

In [32]:
##paliandrome


def is_paliandrome(s):
    return s==s[::-1]

is_paliandrome("madam")

True

In [33]:
##reverse a string

s="srikanta"
s[::-1]

'atnakirs'

In [39]:
##reverse a string without slicing

s="srikanta"
str1=""
for i in s:
    str1=i+str1
    
print(str1)

atnakirs

In [34]:
##reverse a string without using slicing

def reverse_string(s):
    str1=""
    for i in s:
        str1=i+str1
    return str1 

reverse_string("srikanta")

'atnakirs'

In [42]:

def count(num):
    print(num)
    if num==0:
        return 0
    else:
        count(num-1) 

count(5)

5
4
3
2
1
0

In [45]:
## factorial of a number

def factorial(num):
    fact=1;
    if num==0:
        return fact
    else:
        return num*factorial(num-1)
    

factorial(5)

120

In [49]:
addition=lambda x,y : x+y
addition(2,3)

5

In [48]:
### lambda function
addition=lambda *args : sum(args)

addition(2,3,5)

10

In [53]:
numbers=[1,2,3,4,5,6,7,8,9,10]

x=list(map(lambda x:x*x,numbers))

x

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [55]:
numbers1=[1,2,3,4,5,6,7,8,9,10]
numbers2=[10,9,8,7,6,5,4,3,2,1]

x=list(map(lambda x,y:x+y,numbers1,numbers2))
x

[11, 11, 11, 11, 11, 11, 11, 11, 11, 11]

In [56]:
#convert list of integers to string

numbers=[1,2,3,4,5,6,7,8,9,10]

x=list(map(str,numbers))
x

['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

In [58]:



def get_name(person):
    return person["name"]

people=[{"name":"sree","age":30},
        {"name":"kanta","age":40},
        {"name":"sri","age":50}]

x=list(map(get_name,people))
x

['sree', 'kanta', 'sri']

In [59]:
numbers1=[1,2,3,4,5,6,7,8,9,10]
numbers2=[1,9,8,7,26,5,41,3,2,1]

x=list(filter(lambda x:x>30 ,list(map(lambda x,y:x+y,numbers1,numbers2))))
x

[31, 48]

In [60]:
number=[1,2,3,4,5,6,7,8,9,10]

x=list(filter(lambda x:x>5 and x%2==0,number))
x

[6, 8, 10]

In [62]:



number=[1,2,3,]

itertr=iter(number)

while True:
    try:
        print(next(itertr))
    except StopIteration:
        break

1
2
3

In [66]:
## closures in python
## function returning another function is called closure

def outer_func(name):
    message="hi"
    def inner_func():
        print(message)
        print(name)
    return inner_func()


outer_func("srikanta")

hi
srikanta

In [67]:
import pandas as pd

data = [['John', 50, 'Male', 'Austin', 70],
        ['Cataline', 45 ,'Female', 'San Francisco', 80],
        ['Matt', 30 ,'Male','Boston', 95]]

# Column labels of the DataFrame
columns = ['Name','Age','Sex', 'City', 'Marks']

# Create a DataFrame df
df = pd.DataFrame(data, columns=columns)

df['Sex'].value_counts()

Male      2
Female    1
Name: Sex, dtype: int64

In [7]:
import pandas as pd

product=pd.DataFrame({
    'Product_ID':[101,102,103,104,105,106,107],
    'Product_name':['Watch','Bag','Shoes','Smartphone','Books','Oil','Laptop'],
    'Category':['Fashion','Fashion','Fashion','Electronics','Study','Grocery','Electronics'],
    'Price':[299.0,1350.50,2999.0,14999.0,145.0,110.0,79999.0],
    'Seller_City':['Delhi','Mumbai','Chennai','Kolkata','Delhi','Chennai','Bengalore']
})

In [13]:
customer=pd.DataFrame({
    'id':[1,2,3,4,5,6,7,8,9],
    'name':['Olivia','Aditya','Cory','Isabell','Dominic','Tyler','Samuel','Daniel','Jeremy'],
    'age':[20,25,15,10,30,65,35,18,23],
    'Product_ID':[101,0,106,0,103,104,0,0,107],
    'Purchased_Product':['Watch','NA','Oil','NA','Shoes','Smartphone','NA','NA','Laptop'],
    'City':['Mumbai','Delhi','Bangalore','Chennai','Chennai','Delhi','Kolkata','Delhi','Mumbai']
})



print(product)
print(customer)

   Product_ID Product_name     Category    Price Seller_City
0         101        Watch      Fashion    299.0       Delhi
1         102          Bag      Fashion   1350.5      Mumbai
2         103        Shoes      Fashion   2999.0     Chennai
3         104   Smartphone  Electronics  14999.0     Kolkata
4         105        Books        Study    145.0       Delhi
5         106          Oil      Grocery    110.0     Chennai
6         107       Laptop  Electronics  79999.0   Bengalore
   id     name  age  Product_ID Purchased_Product       City
0   1   Olivia   20         101             Watch     Mumbai
1   2   Aditya   25           0                NA      Delhi
2   3     Cory   15         106               Oil  Bangalore
3   4  Isabell   10           0                NA    Chennai
4   5  Dominic   30         103             Shoes    Chennai
5   6    Tyler   65         104        Smartphone      Delhi
6   7   Samuel   35           0                NA    Kolkata
7   8   Daniel   18           0                NA      Delhi
8   9   Jeremy   23         107            Laptop     Mumbai

merge is inner join

In [17]:
pd.merge(product,customer,on='Product_ID')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

full JOIN

In [18]:
pd.merge(product,customer,on='Product_ID',how='outer')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350.5,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Kolkata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,NA,Delhi
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NA,Chennai
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NA,Kolkata
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NA,Delhi

#to know which column belongs to whics table left or right or both use indiacator=True

In [19]:
pd.merge(product,customer,on='Product_ID',how='outer',indicator=True)

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City,_merge
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai,both
1,102,Bag,Fashion,1350.5,Mumbai,NaN,NaN,NaN,NaN,NaN,left_only
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai,both
3,104,Smartphone,Electronics,14999.0,Kolkata,6.0,Tyler,65.0,Smartphone,Delhi,both
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN,left_only
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore,both
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai,both
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,NA,Delhi,right_only
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NA,Chennai,right_only
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NA,Kolkata,right_only
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NA,Delhi,right_only

In [20]:
pd.merge(product,customer,on='Product_ID',how='left')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350.5,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Kolkata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

In [ ]:
print(product)
print(customer)

Handling Redundancy/Duplicates in Python Joins

In [21]:
product_dup=pd.DataFrame({
'Product_ID':[101,102,103,104,105,106,107,103,107],
'Product_name':['Watch','Bag','Shoes','Smartphone','Books','Oil','Laptop','Shoes','Laptop'],
'Category':['Fashion','Fashion','Fashion','Electronics','Study','Grocery','Electronics','Fashion','Electronics'],
'Price':[299.0,1350.50,2999.0,14999.0,145.0,110.0,79999.0,2999.0,79999.0],
'Seller_City':['Delhi','Mumbai','Chennai','Kolkata','Delhi','Chennai','Bengalore','Chennai','Bengalore']
})

In [22]:
#we will get the duplicates in the product_id column  103 107
pd.merge(product_dup,customer,on='Product_ID',how='inner')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
4,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
5,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai
6,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [23]:
#to avoid duplicates in the product_id column
pd.merge(product_dup.drop_duplicates(),customer,on='Product_ID',how='inner')

,Product_ID,Product_name,Category,Price,Seller_City,id,name,age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai